{
    "date": "2025",
    "id": "event-control",
    "tech_stack": "Svelte, SvelteKit, TS, Go, SQLite",
    "title": "Event Control",
    "thumbnail": "/grid/kube.png",
    "body": [
        {
            "subtitle": "Project Overview 📋",
            "body": "The Event Control project is a comprehensive platform for managing and running robotics tournaments, built to replace the VEX Tournament manager. It covers all stages from event setup to live match control and scoring. The system integrates UI and database layers to ensure seamless tournament operations, designed to withstand network drops and poor WiFi often found in tournament venues.",
            "src": "/images/mecha-mayhem/mecha-people.jpg",
            "href": "https://www.mechamayhem.ca/"
        },
        {
            "subtitle": "Key Work 🔑",
            "body": "• Designed and implemented full-stack architecture and automations \n\n  • Reduced LCP by > 90% by leveraging dynamic imports, slashing bundle sizes by more than 66% \n\n • Deployed the frontend on Vercel, backend on AWS EC2, AWS S3 for media storage, and Firebase Firestore for real-time NoSQL database\n\n • Automated match clips extraction from event livestreams using Tesseract OCR \n\n • Prototyped a mobile app for the event using React-Native \n\n • Attributed with helping raise over $20,000 in sponsorships annually"
        },
        {
            "subtitle": "Frontend 💻",
            "body": "• UI Designed in Figma \n\n • Implemented in Next.js, using Tailwind CSS and Framer-Motion for styling and animation\n\n • Configured Next.js middleware to proxy /api requests to the backend endpoint \n\n  • Optimized loading performance and bundle sizes with efficient asset management, SSR, and dynamic loading \n\n • Ensured accessibility (a11y) compliance with semantic HTML and ARIA roles",
            "src": "/images/mecha-mayhem/figma.png"
        },
        {
            "subtitle": "Backend & Stream Processing 💽",
            "body": "• REST API built with Express.js and Firebase Firestore, deployed on an Amazon EC2 instance\n\n • Used AWS S3 for file storage and Cloudflare for HTTPS + CDN performance\n\n • Configured reverse proxy routing to serve the API under /api while maintaining HTTPS integrity\n\n • Developed a Python-based livestream splitter to auto-segment match footage using Tesseract OCR + FFmpeg\n\n • Achieved accurate timestamp extraction and video slicing from 11+ hour robotics competition streams",        
            "src": "",
            "href": ""
        },
        {
            "subtitle": "Project Organization 🚩",
            "body": "",
            "src": "",
            "href": ""
        }
    ]
}
