{
    "date": "2023",
    "id": "swcdb",
    "tech_stack": "Python, Flask, ",
    "title": "SWC Disnake Bot",
    "thumbnail": "/grid/swc.png",
    "body": [
        {
            "subtitle": "Project Overview 📋",
            "body": "This project is a custom-built Discord bot designed to streamline the parts ordering process for our robotics club. It enables team members to submit parts requests directly through Discord, helping us manage inventory and order fulfillment efficiently."
        },
        {
            "subtitle": "A Simple Probability-Based Algorithm to Fix Misspelled Words  🧠",
            "body": "This spelling corrector uses Bayesian probability to find the most likely correction for a misspelled word. For a given typo w, it selects the word c that maximizes P(c | w) ∝ P(w | c) * P(c), where P(c) is based on word frequency from a large corpus, and P(w | c) is based on the likelihood of typos (insertions, deletions, swaps, and replacements) measured by edit distance. This algorithm is ideal for correcting common typos in a small subset of words (ie: part names) and runs in O(n) time, where n is the number of words in the dictionary. Thus, we are able to avoid the use of ML or more expensive solutions that would require a considerbly larger dataset of typos and their corrections."
        },        
        {
            "subtitle": "Features 🚀",
            "body": "The bot includes features such as part request submission, inventory management, and order tracking. It also provides real-time updates and notifications to keep team members informed about their requests."
        },
        {
            "subtitle": "Tech Stack 🛠️",
            "body": "The bot is built using Python and the Disnake library, which provides a simple and efficient way to interact with the Discord API. It also utilizes Flask for web server capabilities, allowing for easy integration with our existing systems.",
            "href" : "https://github.com/liuisaac/SWC-Disnake-Bot"
        }
    ]
}